{
  "page": 1,
  "prev_page_endpoint": null,
  "next_page_endpoint": null,
  "total_pages": 1,
  "reasons": [
    {
      "created_at": "2014-03-31T01:21:22Z",
      "content": "I received an honor code violation last semester for helping a few struggling friends understand an algorithm, despite completing my projects independently. I find it completely ridiculous that i am being forced to retake a class that i would have otherwise had an A in. I have been programming since high school and code for fun on the weekends, and now i find myself turning away from CS after this entire ordeal. Ready for GMU to start mirroring the school's honor codes that are producing more success for CS majors. They are obviously doing something right since they are the top programs.",
      "like_count": 4,
      "author_name": "jackie lasky",
      "author_url": "https://api.change.org/u/87941970"
    },
    {
      "created_at": "2014-04-01T02:17:38Z",
      "content": "I am a professional computer scientist for almost 30 years. I have been interviewed a lot of people around the U.S. University. Especially I have hire 5 students from GMU, they still work for me now. I don't see any reason why students cannot work as a team.My GMU students at my work now still have to work on a team. It is good practice to let students socialize and learn from others, it will help this progress as better computer scientist if they learn how to work as a team. In the real world, if you don't socialize and learn how to work as a team brainstorming and host meetings you cannot do the right job to come up with the right product. That is why the U.S. students are not as \"smart\" as other students in other countries who are actually cooperating with each other at a higher level then we are. This makes the student feel bad and holds back the talents and potential of students. It keeps students from believing in themselves and frustrates them. If students are cheating, school can punish them, but discussing the projects together for help should not be cheating if they are trying to learn together. Do professors think its fair to see a lot of their students fail discouraging students to get their degree. There must be something wrong with GMU that many students are failing because of a policy like this. ",
      "like_count": 4,
      "author_name": "Tonny Nguyen",
      "author_url": "https://api.change.org/u/88071845"
    },
    {
      "created_at": "2014-04-07T16:55:42Z",
      "content": "Forbe's magazine \"top 10 skills employers look for in hirees\"\r\n1. Teamwork \r\nhttp://www.forbes.com/sites/susanadams/2013/10/11/the-10-skills-employers-most-want-in-20-something-employees/",
      "like_count": 3,
      "author_name": "Nicholas Plummer",
      "author_url": "https://api.change.org/u/35011607"
    },
    {
      "created_at": "2014-03-31T13:28:27Z",
      "content": "I go to Purdue University, but I felt the need to sign this petition on behalf of all my friends attending the CS program at GMU. The honor code at GMU is disgusting and backwards in a field that is ever changing, requiring collaboration to play a bigger and bigger role. People failing a class because they helped a fellow classmate understand a topic or algorithm is horrible and should never have been allowed to take place.",
      "like_count": 2,
      "author_name": "Michael Schloss",
      "author_url": "https://api.change.org/u/theschloss"
    },
    {
      "created_at": "2014-03-31T00:27:37Z",
      "content": "I hate just sitting there and watching my friends fail. I want to be able to work with my classmates like how it is in the real world. I want to collaborate about my code. Not give away my code.",
      "like_count": 2,
      "author_name": "Michael Hudson",
      "author_url": "https://api.change.org/u/87939276"
    },
    {
      "created_at": "2014-03-31T00:09:57Z",
      "content": "A friend was given an honor code violation for helping fellow students understand an algorithm, which resulted in similar code. I worked as a TA in the CS department and it upsets me that a desire to help others learn could be punished.",
      "like_count": 2,
      "author_name": "Dale Gartman",
      "author_url": "https://api.change.org/u/87938449"
    },
    {
      "created_at": "2014-04-11T02:16:25Z",
      "content": "My real world perspective having been in the computer industry for 20+ years is that collaboration and idea exchange is the best way to deliver successfully on complex software projects. GMU should encourage students to learn by collaboratively sharing and contributing to the project work. While I understand that the university concern is that students may not produce original work, the pendulum has swung too far in the honor code towards punishment and discouragement rather then learning and growing. I share these views as an GMU Alumni, for the betterment of the university and the students.",
      "like_count": 1,
      "author_name": "NS Rana",
      "author_url": "https://api.change.org/u/24370147"
    },
    {
      "created_at": "2014-04-13T23:17:52Z",
      "content": "i got blamed for a honor code, basically failed my class because of that. The professor is a useless instructor and as careless as a middle schooler",
      "like_count": 1,
      "author_name": "Asish Dahal",
      "author_url": "https://api.change.org/u/89559638"
    },
    {
      "created_at": "2014-03-30T14:32:39Z",
      "content": "In a work setting, looking up options for coding or guides on algorithms that may be well know are perfectly allowed by companies. We should strive, as a department, to prepare students for their careers in the real world rather than focusing strictly on grading and individual accomplishment. We don't need to reinvent the wheel, here!",
      "like_count": 1,
      "author_name": "Moose Repole",
      "author_url": "https://api.change.org/u/87901660"
    },
    {
      "created_at": "2014-04-04T01:46:01Z",
      "content": "This class is extremely unfair for all the students that take it. There is a huge discrepancy amongst the students within this class. Some students have never been exposed to computer programming while others have. To some this course is easy, while others find it extremely difficult. Those who haven't been exposed to this subject need help but have nowhere to turn for help. It is an honor code violation for just about every thing possible. Asking certain questions in office hours or posting certain question or examples on our public course page can be considered an honor code violation. Collaborating with students, discussing logic, seeking out peer tutors are all honor code violations. On top of that, the average meeting time for students with the professor is seven minutes simply due to the fact that so many people have questions. So, basically these professors are saying that seven minutes is the only time to get decent one on one help, for a class that requires dozens of hours of studying no less. So if you strip students of their every resource to even get a gist of what is going on with this class what are they to do, just fail? This course is setting people up for failure. Certain students want to help their peers but when they do so they also fail the class. It is stifling the learning process. Students become so apprehensive about honor code that they cannot properly learn. Group work and collaboration is a universal teaching tool that this class is deciding to navigate away from. Is the goal of this class to have a high fail rate to send a message or is it to properly teach and develop students for their remainder of their programs? Neglecting to change the structure of this class will only exacerbate the problem, therefore it needs to change!",
      "like_count": 1,
      "author_name": "Isaiah West",
      "author_url": "https://api.change.org/u/88415233"
    },
    {
      "created_at": "2014-03-30T02:13:18Z",
      "content": "Much of the material we learn during lectures are not helping us as much and we have to learn most of the coding on our own. Especially with beginners, many people are struggling in the class and when they try to look for help, they can only resort to using Piazza and the Professors. Even so, the professors are usually busy and then they begin to rely on other things which are more easily accessible. Though I am transitioning through the class at a good pace, some students have trouble learning the material and fail the course because of it. They are in a deadlock.",
      "like_count": 1,
      "author_name": "Brian Khong",
      "author_url": "https://api.change.org/u/87870088"
    },
    {
      "created_at": "2014-04-14T16:09:46Z",
      "content": "Because I have experienced the toxicity atmosphere that the honor code creates between fellow students, It is like everyone is afraid of each other and collaboration I think is key to maximize the learning process.",
      "like_count": 1,
      "author_name": "Luis Velasco",
      "author_url": "https://api.change.org/u/89627443"
    },
    {
      "created_at": "2014-03-31T22:37:01Z",
      "content": "Oh the horror!! Imagine, a group of GMU students actually coming together to study and practice in their major field of interest. How dare they take a global and multidisciplinary approach to learning and problem -solving. If those who teach CS112 and those who govern over its curriculum could tear themselves away from their antiquated teaching styles, they would realize that the best way to retain and assimilate new information is to teach it to someone else. Yet they are not concerned with their CS and ACS students successfully learning the material. Why would they be, when faculty are encouraged to continue their fishing expeditions, erroneously accusing students of committing honor code violations that initiate academic sanctions which significantly delay the student’s progress and filter out prospective CS graduates at a time where industry’s need for men and women in this field is paramount?\r\nBut wait, where have we heard these innovative words “global and multidisciplinary approach to learning” before? Could it be from leaders in industry and in progressive academic arenas? And lest we, the newest GMU parents forget, we heard those words proclaimed by Mason’s own President Ángel Cabrera during his orientation address to new students and their families. It is further exemplified by the hiring of Mason’s newest Provost, Dr. David Wu, who in an interview upholds the approach stating, “All major disciplines of study represent different thinking paradigms. You’re equipping young people with multiple perspectives of thinking, to take a holistic view in solving the world’s problems.” He further goes on to espouse Mason’s long term goal of “delivering 100,000 career-ready graduates over the next decade.” I wonder how Provost Wu will view the VSE’s antithetic approach of discouraging students to graduate with degrees in STEM fields by delaying and derailing their academic progress.\r\nIn a day where other universities are exploring innovative, online, teaching models, it is time for the VSE Departments of Computer Sciences, Applied Computer Sciences and Information Technology to embrace such methods of learning or be left in the dust of their outdated, heavy handed, sanctions via the administration of excessive code violations. Change is imminent, get on board or get out these students’ way.\r\n",
      "like_count": 1,
      "author_name": "Patricia Miers",
      "author_url": "https://api.change.org/u/88052547"
    },
    {
      "created_at": "2014-04-15T22:55:41Z",
      "content": "If you are already superior then you don't have to go to school. Projects for me are in-depth homework, and homework takes many efforts for comprehension. Even our professor admits there are always bugs somewhere in our project. If one can manage to finish the project, it means he or she understands the concept well enough. It does not mean he or she is a non-cheater. The current Honor Code motivates people who already learned the materials, not those who are trying learn. I'm a straight A student in the department yet I still have to come to the professor for discussion. Would it be better if someone thoroughly understands the concept already helps other students who are \"disabled\" in critical thinking? I'm one of the greatest CS students in the department now, yet I admit that CS is easy for me because I have a formidable background of math and wide knowledge of Java, which helps me a lot in understanding the syntax and logic. The number of CS students submitted to the Honor Code Policy is increasing over terms, which means the professors are responsible for the bad performance of their students. I don't think our professors are bad. I believe the policy forces them to act like it. If someone tries to catch cheaters, catch them in the exam, for exams reflect true work on the table; cheaters won't think through the problems and will receive bad grades. Don't catch people when they are trying to learn new things. If watching Youtube helps solve the project, THEN the project is too easy. Period! It's not cheating under any circumstances. What if one day, all my hard work to build my reputation and image is decimated by this misinterpreted Honor Code? The policy is deteriorating the generations. ",
      "like_count": 1,
      "author_name": "Viet Tran",
      "author_url": "https://api.change.org/u/89791998"
    },
    {
      "created_at": "2014-04-17T15:43:46Z",
      "content": "I completely agree with the the whole collaboration vs duplication debate. Through my accede mic years, I've been taught that great minds are stronger in numbers. We were encouraged in the past to work together to produce works that surpasses each of our individual limitations. I don't see why that should be different in programming. Why are we having to work alone, whereas software developers in successful companies work in a team?",
      "like_count": 1,
      "author_name": "Adil Ahmad",
      "author_url": "https://api.change.org/u/90013981"
    },
    {
      "created_at": "2014-04-30T17:54:15Z",
      "content": "I know a few CS and IT students and I plan on hopefully going to Mason in a few years.\r\nAnd the interwebz are useful 4 code. Fix pl0x.",
      "like_count": 0,
      "author_name": "Michael Bailey",
      "author_url": "https://api.change.org/u/3082668"
    },
    {
      "created_at": "2014-03-30T21:30:37Z",
      "content": "I have many friends in the department and feel like this is just unacceptable.",
      "like_count": 0,
      "author_name": "Eric Black",
      "author_url": "https://api.change.org/u/87930248"
    },
    {
      "created_at": "2014-03-30T19:34:13Z",
      "content": "CS blows. ",
      "like_count": 0,
      "author_name": "Ali Zaidi",
      "author_url": "https://api.change.org/u/27383448"
    },
    {
      "created_at": "2014-03-29T23:10:26Z",
      "content": "I'm not taking any CS classes yet, but GMU has a tendency to create ridiculous policies that really put students in a bad position.",
      "like_count": 0,
      "author_name": "Kirsten Goodrow",
      "author_url": "https://api.change.org/u/69098222"
    },
    {
      "created_at": "2014-03-30T04:14:01Z",
      "content": "I got honor code for helping my friend understand the concept, resulting in having similar java code.",
      "like_count": 0,
      "author_name": "Anthony Johnson",
      "author_url": "https://api.change.org/u/87874174"
    },
    {
      "created_at": "2014-03-30T00:27:22Z",
      "content": "I received an honor code violation for helping somebody out by showing them part of my code, which led me to having to retake the class that I passed with more than 100% next semester. This is a class that I took for fun and quite frankly it is ridiculous that coding, one of the things that requires the most cooperation on a business level, would disallow any form of collaboration whatsoever.",
      "like_count": 0,
      "author_name": "Vincent Caetto",
      "author_url": "https://api.change.org/u/87865688"
    },
    {
      "created_at": "2014-04-23T20:57:10Z",
      "content": "Because it creates a really bad learning enviroment",
      "like_count": 0,
      "author_name": "Kensei Matsuda",
      "author_url": "https://api.change.org/u/90569634"
    },
    {
      "created_at": "2014-03-30T23:12:42Z",
      "content": "The policy should be laxed until the people who are looking for help can get it in a feasible way. Those going to office hours or to tutoring sessions can't reasonably get the help they need. Some students' only resort is to ask a friend for help or to use the internet. Failing 20% of the class every semester is a bit much.",
      "like_count": 0,
      "author_name": "Nathan Archer",
      "author_url": "https://api.change.org/u/87935774"
    },
    {
      "created_at": "2014-03-30T04:40:35Z",
      "content": "I feel like the computer science honor code policy is too harsh, and I would like it to change.",
      "like_count": 0,
      "author_name": "Luke Weaver",
      "author_url": "https://api.change.org/u/87875008"
    },
    {
      "created_at": "2014-04-20T18:00:02Z",
      "content": "My friends were accused of violating the honor code when they just followed instructions ",
      "like_count": 0,
      "author_name": "yasmeen aloumi",
      "author_url": "https://api.change.org/u/90244458"
    },
    {
      "created_at": "2014-04-02T23:17:15Z",
      "content": "My good friend and roomate had to retake a class he should of aced because someone on his floor copied his code. I find this unfair and would hope that this petition might change things in the future.",
      "like_count": 0,
      "author_name": "Ezra Williams",
      "author_url": "https://api.change.org/u/88273529"
    },
    {
      "created_at": "2014-04-30T15:34:23Z",
      "content": "I think it is right.",
      "like_count": 0,
      "author_name": "Suliman Alshammary",
      "author_url": "https://api.change.org/u/91245922"
    },
    {
      "created_at": "2014-03-31T04:39:23Z",
      "content": "It's almost suffocating when I run into issues with code, I don't know where do go other than ask the TA's last minute for some help which doesn't always field good results. I want to be able to get different perspectives and ideas; in high school I learned the most about coding from my friend, at GMU I'm afraid to even talk about coding aspects.",
      "like_count": 0,
      "author_name": "Alex Strauch",
      "author_url": "https://api.change.org/u/87951701"
    },
    {
      "created_at": "2014-03-30T18:00:15Z",
      "content": "Collaboration is key in any industry and students should be able to help each other without any penalty.",
      "like_count": 0,
      "author_name": "Leesa Bonilla",
      "author_url": "https://api.change.org/u/87915446"
    },
    {
      "created_at": "2014-03-31T13:09:08Z",
      "content": "As a student I can understand wanting to limit cheating but at this point you are limiting the ability of your students to grow academically. ",
      "like_count": 0,
      "author_name": "Andrew Jackman",
      "author_url": "https://api.change.org/u/87984629"
    },
    {
      "created_at": "2014-04-08T04:21:53Z",
      "content": "I take CS at Mason and I have seen a lot of my friends get screwed out of a grade because it's impossible to fight honor code violation claims. ",
      "like_count": 0,
      "author_name": "Jason Haun",
      "author_url": "https://api.change.org/u/88885440"
    },
    {
      "created_at": "2014-03-30T23:21:42Z",
      "content": "I am a CS major at another school but I understand the difficulty these students are going through. Some issues are simply not covered in class and thus it is up to the student to research and deal with these issues. I support more flexibility of the honor code.",
      "like_count": 0,
      "author_name": "Aaron Martin",
      "author_url": "https://api.change.org/u/87936179"
    },
    {
      "created_at": "2014-04-05T15:33:34Z",
      "content": "I go to JMU, but my friend was set back many semesters from graduating because of this violation. It's ridiculous and needs to change.",
      "like_count": 0,
      "author_name": "Rachel Berry",
      "author_url": "https://api.change.org/u/88584981"
    },
    {
      "created_at": "2014-03-29T22:23:44Z",
      "content": "This is completely true, not only for the CS and ACS majors, but also other majors that have to take a CS department class. ",
      "like_count": 0,
      "author_name": "Stephen Davis",
      "author_url": "https://api.change.org/u/87859046"
    },
    {
      "created_at": "2014-03-29T22:09:20Z",
      "content": "My Roommate received an unfair honor code violation, which will likely cause him to fail the class which is needed for his major.",
      "like_count": 0,
      "author_name": "Ricky Myers",
      "author_url": "https://api.change.org/u/87858230"
    },
    {
      "created_at": "2014-03-30T17:28:56Z",
      "content": "I was subject to an Honor Code violation by GMU for helping other students in need.",
      "like_count": 0,
      "author_name": "Andreas Ochoa",
      "author_url": "https://api.change.org/u/70347466"
    },
    {
      "created_at": "2014-04-01T05:56:12Z",
      "content": "This policy has made me fearful of getting help. I am paying for the class so I can teach myself, which should not happen. I want to learn, but it is hard when almost every question asked is considered cheating. It is an intro class, and I realize that they want to teach us to think, but not being able to code well already makes the task almost impossible.",
      "like_count": 0,
      "author_name": "Henry Arzaz",
      "author_url": "https://api.change.org/u/88084334"
    },
    {
      "created_at": "2014-04-18T04:29:52Z",
      "content": "Honestly, surviving college without an honor code problem is hard enough. I'm a computer engineering student, and the curriculum alone is tough enough; worrying about whether we managed to find one of ten unique ways to solve a problem and hoping we're the only ones to use it is just way too much work. I also agree that collaboration is incredibly important and is the key to success. This is a poor choice of decisions on behalf of masons student body. ",
      "like_count": 0,
      "author_name": "Sean Wolford",
      "author_url": "https://api.change.org/u/90067528"
    },
    {
      "created_at": "2014-03-30T21:41:35Z",
      "content": "I'm going to have to take CompSci courses in order to get my degree in Electrical Engineering.",
      "like_count": 0,
      "author_name": "Sergio Ribeiro",
      "author_url": "https://api.change.org/u/27028446"
    },
    {
      "created_at": "2014-04-03T02:49:12Z",
      "content": "I was a victim of this stupid policy....Because of commenting on a FB post",
      "like_count": 0,
      "author_name": "George Bencivengo",
      "author_url": "https://api.change.org/u/30737090"
    },
    {
      "created_at": "2014-03-31T06:57:37Z",
      "content": "I have gone through CS 112 myself and I had to take the class twice just to pass it with a C. The program DOES not cater to intro students at all and expects you to just know how to do things without any adequate help. That's not how the CS industry works in the real world.",
      "like_count": 0,
      "author_name": "TJ Ogunkile",
      "author_url": "https://api.change.org/u/87958120"
    },
    {
      "created_at": "2014-04-01T10:43:17Z",
      "content": "I know one of the accused students and see how ridiculous the accusation was. These policies are creating a cutthroat and hostile environment for the students.",
      "like_count": 0,
      "author_name": "Brenda Pipik",
      "author_url": "https://api.change.org/u/88099798"
    },
    {
      "created_at": "2014-03-29T23:35:41Z",
      "content": "I was charged with honor violation, though not guilty. I was found innocent. It put me back a whole semester, and if I had been found guilty I would've had to retake the course, in which I would've had an A.",
      "like_count": 0,
      "author_name": "Mary Leskovec",
      "author_url": "https://api.change.org/u/70527888"
    },
    {
      "created_at": "2014-03-31T01:18:29Z",
      "content": "I am failing a CS class. I see no problem with working together with people to create code, especially in an introductory course.",
      "like_count": 0,
      "author_name": "Justin Nguyen",
      "author_url": "https://api.change.org/u/87941838"
    },
    {
      "created_at": "2014-04-02T19:38:26Z",
      "content": "I am a CS major at GMU and I care about the well-being of students. I do not think anyone can thrive in an intense, stressful environment like this. It is time for change. ",
      "like_count": 0,
      "author_name": "Areej Radwan",
      "author_url": "https://api.change.org/u/10919804"
    },
    {
      "created_at": "2014-03-31T00:04:49Z",
      "content": "It's BS and they need to be called out on it.",
      "like_count": 0,
      "author_name": "Jonathon Willey",
      "author_url": "https://api.change.org/u/87938221"
    },
    {
      "created_at": "2014-04-02T19:01:34Z",
      "content": "I had a friend who did not cheat in CS but is being forced to take it again due to this ridiculous honor code",
      "like_count": 0,
      "author_name": "Samantha Christensen",
      "author_url": "https://api.change.org/u/88251255"
    },
    {
      "created_at": "2014-03-30T16:16:17Z",
      "content": "It's bullshit how you can only get help from Professors. ",
      "like_count": 0,
      "author_name": "Devon Pruzan",
      "author_url": "https://api.change.org/u/87908451"
    },
    {
      "created_at": "2014-04-03T09:31:19Z",
      "content": "I got a 0 on a large assignment just because I posted a picture of unusable, non-working code on facebook as a joke. No one benefited or could have had any use for the code I randomly posted. But merely the fact that it was labeled as my assignment's name made it count as a violation.",
      "like_count": 0,
      "author_name": "Alexander Barsukov",
      "author_url": "https://api.change.org/u/8874589"
    },
    {
      "created_at": "2014-03-30T14:43:26Z",
      "content": "I shouldn't be afraid to learn because the school did not approve of how I learned it.",
      "like_count": 0,
      "author_name": "Leland Powell",
      "author_url": "https://api.change.org/u/87902304"
    },
    {
      "created_at": "2014-03-31T01:55:33Z",
      "content": "This honors code issue was a major reason why I left GMU's CS dept. and switched to IT",
      "like_count": 0,
      "author_name": "Thomas Brophy",
      "author_url": "https://api.change.org/u/87943634"
    },
    {
      "created_at": "2014-04-15T08:52:19Z",
      "content": "Im a part of the school of engineering",
      "like_count": 0,
      "author_name": "Ryan Ngo",
      "author_url": "https://api.change.org/u/89709006"
    },
    {
      "created_at": "2014-04-01T15:55:35Z",
      "content": "I'm planning to take a few CS courses for my major and need this system changed.",
      "like_count": 0,
      "author_name": "Julius Ahenkora",
      "author_url": "https://api.change.org/u/88127952"
    },
    {
      "created_at": "2014-03-30T20:45:56Z",
      "content": "Not made clear and apparent, punishes students without them knowing until it is too late and causes more expense to parents when a student has to take the class over. The professor bears a major responsibility in making this crystal clear.",
      "like_count": 0,
      "author_name": "Robin Lasky",
      "author_url": "https://api.change.org/u/87927441"
    },
    {
      "created_at": "2014-03-31T06:48:30Z",
      "content": "I am a VSE student and know friends effected by this",
      "like_count": 0,
      "author_name": "Spencer Woodfork",
      "author_url": "https://api.change.org/u/87957627"
    },
    {
      "created_at": "2014-04-22T15:49:55Z",
      "content": "Because the college system is broken and the students will be the driving force in fixing it.",
      "like_count": 0,
      "author_name": "brad wilson",
      "author_url": "https://api.change.org/u/90414233"
    },
    {
      "created_at": "2014-04-11T04:46:29Z",
      "content": "Because there is a difference between someone actually cheating and someone being failed just so department could use some extra bucks when they retake the class.",
      "like_count": 0,
      "author_name": "Mihir Bhojani",
      "author_url": "https://api.change.org/u/25221794"
    },
    {
      "created_at": "2014-03-30T17:46:49Z",
      "content": "I had friends who happened to have similar code and wasted a lot of time and effort getting an honor code violation straightened out. ",
      "like_count": 0,
      "author_name": "Steven Black",
      "author_url": "https://api.change.org/u/87914492"
    },
    {
      "created_at": "2014-04-06T18:43:40Z",
      "content": "It's unbelievable that collaboration at a university is prohibited, especially with how CS112 and CS211 are treated as weed out classes with minimal effort from the professors. The GMU code says we can get help from the professors and TA's, but I recall a fiasco in CS112 where the TA gave out some pseudo-code and was later admonished for doing so; the point I'm trying to make, is that you can't really get any help from the CS faculty, being a CS major is actively finding ways to get help without getting considered a cheater. ",
      "like_count": 0,
      "author_name": "Eric Shamberger",
      "author_url": "https://api.change.org/u/20584520"
    },
    {
      "created_at": "2014-04-01T04:08:46Z",
      "content": "I think this is dumb because later on you are going to have a job where you need to work as a team and get through problems together..",
      "like_count": 0,
      "author_name": "Oscar Terrazas",
      "author_url": "https://api.change.org/u/88079230"
    },
    {
      "created_at": "2014-03-30T00:29:31Z",
      "content": "Being a first year CS major myself, I have continued to experience hardships regarding intro level CS courses. A lot of it has to do with not only the difficulty of a course that is the VERY FIRST course for the major but also the lack of availability of help. Getting help is very restricted leaving only office hours and Piazza. Piazza is only so helpful and explaining concepts over the internet is nearly impossible and almost all the office hours available conflict with my class schedule. Though my passion for CS remains intact due to my experience with CS outside of my courses at Mason, I cannot say the same for others. I have come across countless students who have chosen a different major because of the way these intro level courses are organized and taught and how they have been introduced to this major. These courses are making students doubt their own skills and intelligence when they're expected to work in such an impossible environment full of restrictions. ",
      "like_count": 0,
      "author_name": "Susmtia Gautam",
      "author_url": "https://api.change.org/u/87865832"
    },
    {
      "created_at": "2014-04-02T03:42:23Z",
      "content": "I have become afraid of any interactions with my peers.",
      "like_count": 0,
      "author_name": "Spencer Hawkins",
      "author_url": "https://api.change.org/u/88179663"
    },
    {
      "created_at": "2014-04-14T15:29:36Z",
      "content": "I have to take CS courses for my major",
      "like_count": 0,
      "author_name": "David Garcia",
      "author_url": "https://api.change.org/u/77404545"
    },
    {
      "created_at": "2014-04-10T01:02:25Z",
      "content": "I have heard stories of people whom were accused of being in the honor code violation and being found innocent. Some of them are now in Masters programs and the rest are working in their field.",
      "like_count": 0,
      "author_name": "mustafa salim",
      "author_url": "https://api.change.org/u/89181736"
    },
    {
      "created_at": "2014-03-29T22:43:51Z",
      "content": "I am a CS major and do not believe some of these policies are fair or even right.",
      "like_count": 0,
      "author_name": "Clifford Baker",
      "author_url": "https://api.change.org/u/49333633"
    },
    {
      "created_at": "2014-05-01T02:20:57Z",
      "content": "I believe that it is unfair.",
      "like_count": 0,
      "author_name": "Yazan Alotaibi",
      "author_url": "https://api.change.org/u/91305950"
    },
    {
      "created_at": "2014-04-12T03:16:58Z",
      "content": "CS major. ",
      "like_count": 0,
      "author_name": "Sharbesh Adhikari",
      "author_url": "https://api.change.org/u/89426187"
    },
    {
      "created_at": "2014-03-31T23:05:47Z",
      "content": "I have seen too many people get sent to the honor committee over \"infractions\" with very little evidence and have their time wasted.",
      "like_count": 0,
      "author_name": "Andrew Rhim",
      "author_url": "https://api.change.org/u/88055247"
    },
    {
      "created_at": "2014-04-04T18:01:41Z",
      "content": "Was accused of honor code violation because the techniques i used was ''advanced\"...this course is extremely hard for an introductory class. This is my 3rd time taking the course they did not take into account that i have accumulated a lot of coding knowledge over time.",
      "like_count": 0,
      "author_name": "Anish Shrestha",
      "author_url": "https://api.change.org/u/88501085"
    },
    {
      "created_at": "2014-03-30T03:55:47Z",
      "content": "Because I am a CS major",
      "like_count": 0,
      "author_name": "Mohammed Faruq",
      "author_url": "https://api.change.org/u/87873632"
    },
    {
      "created_at": "2014-03-31T05:19:29Z",
      "content": "Technology is the future, and the internet is an important aspect of learning. Limiting sources like Youtube that help cover things that professors might cover without detail can be detrimental to learning. The internet allows us to learn from our pears from around the world, something unique and positive to the current age of CS and game design majors cannot be understated, as we've grown up in an age of learning on our own through the medium of the internet.",
      "like_count": 0,
      "author_name": "Chris Franklin",
      "author_url": "https://api.change.org/u/25056153"
    },
    {
      "created_at": "2014-03-30T16:41:21Z",
      "content": "I find it incredibly unfair that George Mason University students are not permitted to help each other on programming assignments. Finding ways to implement new data structures and programming techniques can be very difficult. Not to mention learning entirely new programming languages. These complex puzzles we are expected to solve every week can prove to be very frustrating. In math classes, if there is an equation that we do not understand, we are permitted to speak with other students about possible methods and solutions. However, this form of learning for computer science students does not exist at GMU. We are not permitted to learn from each other, or help each other in any way. Pier-learning is one of the most powerful and effective ways in which an educational environment is stimulated. Our current restricted programming policies do nothing but hinder the student's learning process. ",
      "like_count": 0,
      "author_name": "David Powell",
      "author_url": "https://api.change.org/u/58310286"
    },
    {
      "created_at": "2014-03-31T00:44:35Z",
      "content": "It's extremely difficult to pass an \"Introductory\" class under these extreme conditions. The professors are also never available leaving you to inept TAs.",
      "like_count": 0,
      "author_name": "Michael Zell",
      "author_url": "https://api.change.org/u/87940135"
    },
    {
      "created_at": "2014-04-14T20:10:06Z",
      "content": "Although I am in IT, the honor code requirements are very similar and seemingly unfair.",
      "like_count": 0,
      "author_name": "Elijah Hope",
      "author_url": "https://api.change.org/u/89659373"
    },
    {
      "created_at": "2014-03-29T22:12:10Z",
      "content": "It's ridiculous.",
      "like_count": 0,
      "author_name": "Jenny Sukh",
      "author_url": "https://api.change.org/u/87858419"
    },
    {
      "created_at": "2014-04-08T03:18:00Z",
      "content": "This is important to me because I'm majoring in Computer Science and I will have to take a lot of CS lectures which will have lots of programming assignments. And the bigger a class is, the more students are working on the same project (and they have also been taught by same professors) so some similarity in code is inevitable. So for professors to Honor Code students just because one student's code is similar with another student's code is outrageous. ",
      "like_count": 0,
      "author_name": "Ashmita Kumar",
      "author_url": "https://api.change.org/u/88870775"
    },
    {
      "created_at": "2014-04-04T02:31:37Z",
      "content": "The Honor Code starts of reasonablely: students should be punished if they steal code from each other or the internet. BUT the rest is OUTRAGEOUS.\r\n\r\n1) Helping other students understand core concepts - Are you kidding me?! So student's can't even study together? or treach each other? There have been studies that prove that when you talk with someone else about a complicated subject you understand it more afterwards (especially if you are teaching them). This removes the possibility that both the student teacher as well as the other student getting help will learn the subject to a higher degree. That what GMU should want for its students. GMU wants students to suceed right?!\r\n\r\n2) Brainstorming ideas to tackle a project - this is understandable especially in cases where the algorithm is a key graded peice..but what my school does is that we allow discussion as long as no notes are taken down during it (or the notes are destroyed) so that the students will still result in completing it slightly different.\r\n\r\n3) (opps this should have been 2) Guiding other students to the lecture notes - SO GMU DOESN'T WANT ITS STUDENTS TO FOLLOW INSTRUCTIONS?!?!\r\n\r\n4) Coding in the same room as another student - At my school (The University of Washington ranked 5th in CSE in the nation) we have labs where people go to program. We encourage people to program in the same room. Like what if GMU had a lab. Could only one person use the ENTIRE computer lab at one time???\r\n\r\n5&6) So basically I understand from all of these thing that a student can only talk to professors, listen to the lecture, and read the book and cannot do anything else to suceed, even if they need extra help. Does GMU even want its students to succeed?\r\n\r\nSeriously. How can people suceed in this enviroment? I feel like everyone in the CSE classes probably has looked up something on the internet at some point or at least talked to another student. It seems like EVERYONE in the ENTIRE class should receive an honor violation.\r\n\r\nAgain. Does GMU even want its students to suceed?\r\n\r\nLike really...because to me it seems like they DON'T.",
      "like_count": 0,
      "author_name": "Krista Holden",
      "author_url": "https://api.change.org/u/88418496"
    },
    {
      "created_at": "2014-04-03T20:44:05Z",
      "content": "Alumni. ",
      "like_count": 0,
      "author_name": "Aram Zucker-Scharff",
      "author_url": "https://api.change.org/u/88385969"
    },
    {
      "created_at": "2014-04-30T18:11:27Z",
      "content": "Because I am a CS student in GMU and I believe in learning.",
      "like_count": 0,
      "author_name": "Raghav Mehta",
      "author_url": "https://api.change.org/u/91264114"
    },
    {
      "created_at": "2014-04-03T00:44:06Z",
      "content": "Because some of my good friends are in this program and I feel after reading these policies change is a must",
      "like_count": 0,
      "author_name": "Nakul Ganju",
      "author_url": "https://api.change.org/u/88279000"
    },
    {
      "created_at": "2014-04-03T00:50:57Z",
      "content": "I am a CS Major",
      "like_count": 0,
      "author_name": "Tony Tran",
      "author_url": "https://api.change.org/u/88279351"
    },
    {
      "created_at": "2014-04-02T22:51:16Z",
      "content": "BECAUSE THESE RULES ARE STUPID AS HELL",
      "like_count": 0,
      "author_name": "Sayan Ekambarapu",
      "author_url": "https://api.change.org/u/88271707"
    },
    {
      "created_at": "2014-03-31T14:20:29Z",
      "content": "I am in the AIT major and share the same issue.",
      "like_count": 0,
      "author_name": "Dan Nguyen",
      "author_url": "https://api.change.org/u/50709585"
    },
    {
      "created_at": "2014-03-30T00:37:57Z",
      "content": "I've only been at GMU for two semesters, but throughout that time it's become apparent to me that this code is flawed. I've seen or heard of countless of my friends being set back semesters or even years due to this policy. In multiple cases it's been enough to convince people to drop the CS major or even enrollment at GMU. How can anyone overlook the problems here anymore?",
      "like_count": 0,
      "author_name": "Alex Handley",
      "author_url": "https://api.change.org/u/70649742"
    },
    {
      "created_at": "2014-03-29T22:13:00Z",
      "content": "This is important to me because I have been affected by this problem. I am game design major coming from an art background and know nothing about coding one of my friends helped me understand the algorithms and now I have an honor code violation.",
      "like_count": 0,
      "author_name": "Steven Brown",
      "author_url": "https://api.change.org/u/87858474"
    },
    {
      "created_at": "2014-03-31T05:10:06Z",
      "content": "Some of these honor code violations are just ridiculous. How can any student be expected to thrive under these super-strict conditions?",
      "like_count": 0,
      "author_name": "Arielle Flax",
      "author_url": "https://api.change.org/u/13438136"
    },
    {
      "created_at": "2014-04-07T23:11:18Z",
      "content": "I am an engineering major who took CS112 and recieved a honor code violation",
      "like_count": 0,
      "author_name": "Austin Parker",
      "author_url": "https://api.change.org/u/88836731"
    },
    {
      "created_at": "2014-03-29T23:00:21Z",
      "content": "As someone who will need to take CS classes, I believe that the current honor code stifles innovation (the same innovation that GMU strives for) and prevents actual comprehension of the material. ",
      "like_count": 0,
      "author_name": "Rohit Madhu",
      "author_url": "https://api.change.org/u/87861438"
    },
    {
      "created_at": "2014-03-31T00:09:21Z",
      "content": "IT 106 has the same guidelines and very unfair to students.",
      "like_count": 0,
      "author_name": "Raj Panth",
      "author_url": "https://api.change.org/u/87938424"
    },
    {
      "created_at": "2014-03-30T01:20:10Z",
      "content": "I just could not understand why the CS honor code policy was so strict when it came to programming for class projects. Everyone was given the same project to complete, and if sections of code matched up between students, then those students would likely be subjected to an honor code violation. But, everyone has the same project to complete! There are bound to be some similarities in code! This was the exact fear I had when taking CS 112. As a student whose never had experience programming before, I was scared out of my mind for even submitting projects due to the fear if code matched up. I believe students should not be afraid of this, which is why this is important to me that GMU's honor code policy should be taken under advisement. ",
      "like_count": 0,
      "author_name": "Muhammad Ommer (Momo)",
      "author_url": "https://api.change.org/u/87868013"
    },
    {
      "created_at": "2014-04-01T17:26:43Z",
      "content": "Its important to reform the CS Honor Code Policy because there are many innocent people that get honor code violations due to situations which they have no control of. ",
      "like_count": 0,
      "author_name": "Cindy Shah",
      "author_url": "https://api.change.org/u/88136141"
    },
    {
      "created_at": "2014-04-01T02:06:05Z",
      "content": "If I have see further it is by standing on the shoulder of giants. Chemistry, medicine, biology, engineering, and CS....ALL human knowledge ought to be unlimited. Current plagiarism rules are over sensitive. ",
      "like_count": 0,
      "author_name": "Nathaniel Zhu",
      "author_url": "https://api.change.org/u/88070914"
    },
    {
      "created_at": "2014-04-01T17:18:19Z",
      "content": "We need this to be changed, because it is hindering our learning experiences and pushing us behind for our classes. ",
      "like_count": 0,
      "author_name": "Sean You",
      "author_url": "https://api.change.org/u/88135330"
    },
    {
      "created_at": "2014-04-21T15:05:37Z",
      "content": "It is so wrong!",
      "like_count": 0,
      "author_name": "Yen Luc",
      "author_url": "https://api.change.org/u/90306118"
    },
    {
      "created_at": "2014-04-09T00:17:11Z",
      "content": "I go to GMU",
      "like_count": 0,
      "author_name": "David Morris",
      "author_url": "https://api.change.org/u/2565034"
    },
    {
      "created_at": "2014-03-30T16:05:27Z",
      "content": "As a Computer Science student at Radford University with a 3.9 GPA, this sounds ridiculous to me. I have learned almost everything that I know on the web. Youtube videos are a great way of learning concepts that professors did not have time to show you in class. ",
      "like_count": 0,
      "author_name": "Christopher Mays",
      "author_url": "https://api.change.org/u/87907788"
    },
    {
      "created_at": "2014-04-19T22:07:59Z",
      "content": "I am a computer science major and I think that the current onor code is unfair.",
      "like_count": 0,
      "author_name": "Julius Barnum",
      "author_url": "https://api.change.org/u/90200764"
    },
    {
      "created_at": "2014-04-15T06:25:25Z",
      "content": "I am a computer science major and the honor code policy is unfair.",
      "like_count": 0,
      "author_name": "Keneth Suarez",
      "author_url": "https://api.change.org/u/31065101"
    },
    {
      "created_at": "2014-04-03T01:28:12Z",
      "content": "It is important to my friends and it makes it important to me!",
      "like_count": 0,
      "author_name": "Adel Al-Awadhi",
      "author_url": "https://api.change.org/u/88281852"
    },
    {
      "created_at": "2014-05-03T21:07:51Z",
      "content": "The way the course is taught is incorrect, if your going to teach a computer science it should be taught in a computer lab. I too have endured the struggle of taking a CS class at Mason, and its something that needs to be changed. ",
      "like_count": 0,
      "author_name": "Matthew Dunning",
      "author_url": "https://api.change.org/u/91561855"
    },
    {
      "created_at": "2014-05-01T02:41:53Z",
      "content": "Stanford and GT are way better than Mason and they have more lenient honor code policies. Collaboration is a way of learning.",
      "like_count": 0,
      "author_name": "nouf Alomran",
      "author_url": "https://api.change.org/u/91307214"
    },
    {
      "created_at": "2014-03-30T03:01:07Z",
      "content": "with the different assignments the teachers give there are only but so many ways to code the same program.",
      "like_count": 0,
      "author_name": "Ruben Cubero",
      "author_url": "https://api.change.org/u/87871769"
    },
    {
      "created_at": "2014-03-30T04:12:51Z",
      "content": "CS Student who would like to see a policy of ethics that matches the real-life situations students will face once out of school.",
      "like_count": 0,
      "author_name": "Andrew Moore",
      "author_url": "https://api.change.org/u/29728592"
    },
    {
      "created_at": "2014-03-30T17:00:37Z",
      "content": "I am currently enrolled in CS 112",
      "like_count": 0,
      "author_name": "Sasteh King",
      "author_url": "https://api.change.org/u/87911468"
    },
    {
      "created_at": "2014-03-31T00:29:08Z",
      "content": "the current honor code policy is entirely too strict and the cause of stress for a large number of those working in the CS or IT departments.",
      "like_count": 0,
      "author_name": "Mackenzie Bailey",
      "author_url": "https://api.change.org/u/87939349"
    },
    {
      "created_at": "2014-04-09T01:37:37Z",
      "content": "This will allow CS and Engineering students to learn even better! It's for the sake of enhancing the student's educational experience here at Mason.",
      "like_count": 0,
      "author_name": "Ahmed Rahu",
      "author_url": "https://api.change.org/u/89006240"
    },
    {
      "created_at": "2014-04-07T19:53:50Z",
      "content": "This is a joke right ? What is going with GMU school systems ? Stupid ",
      "like_count": 0,
      "author_name": "Giap Ngo",
      "author_url": "https://api.change.org/u/88813398"
    }
  ]
}